# 1. Поработайте с переменными, создайте несколько, выведите на экран. Запросите у пользователя некоторые числа и строки
# и сохраните в переменные, затем выведите на экран.

# Создаем переменные и выводим на экран
a = 'Это строка, содержащая кавычку – \"'
print(a)

b = 0x10 # Шестнадцатеричное число, но все равно целочисленное
print(b)

# Запрашиваем ввод
c = int(input('Введите число: '))
print(c)

d = float(input('Введите число без дробной части, и оно превратится в вещественное: '))
print(d)

e = str(input('Введите слово: '))
print(e)

f = input('Введите фразу: ')
print(f)