# 7 (Дополнительно). Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10% относительно предыдущего. Требуется определить номер дня, на который
# результат спортсмена составит не менее b километров. Программа должна принимать значения параметров a и b и выводить
# одно натуральное число — номер дня.
# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
# Ответ: на шестой день спортсмен достиг результата — не менее 3 км.

a = input('Введите длительность первой пробежки: ')
b = float(input('Введите конечную длительность пробежки: '))

# Зададим коэффициент увеличения длительности пробежки
geometric_progression_coeff = 1.1

x = 0

while float(a) * (geometric_progression_coeff ** float(x)) < b:
    distance = float(a) * (geometric_progression_coeff ** float(x))
    print(f'{x + 1}-й день: {distance}')
    if distance >= b:
        break
    x += 1

print(f'Для того, чтобы пробежать {b} км с темпом роста 10%, спортсмену, начавшему с {a} км, потребовалось {x} дней')