# 5. Программа запрашивает у пользователя строку чисел, разделённых пробелом. При нажатии Enter должна выводиться сумма
# чисел. Пользователь может продолжить ввод чисел, разделённых пробелом, и снова нажать Enter. Сумма вновь введённых
# чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный символ, выполнение
# программы завершается. Если специальный символ введён после нескольких чисел, то вначале нужно добавить сумму этих
# чисел к полученной ранее сумме и после этого завершить программу.

def summarize():
    total = 0
    esc = False
    while esc == False:
        number = input('Введите числа, разделенные пробелом (или q, чтобы выйти): ').split()
        res = 0
        for el in range(len(number)):
            if number[el] == 'q':
                esc = True
                break
            else:
                res = res + float(number[el])
        total = total + res
        print(f'Сумма чисел равна {total}')
    print(f'Сумма чисел равна {total}')


summarize()
