# 1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого
# элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а
# указать явно, в программе.

li = [11, 10.1, 3 + 2j, 'альтернатива', [9, 7], (6, 5), ('a', 'b', 'c', 'd'), {'key': 'value', 'key2': 4}, False,
      b'particle', bytearray(b'star'), None]

def show_type(self):
    i = 0
    for i in range(len(li) - 1):
        print(type(li[i]))
        i += 1

show_type(li)
