# 2. Для списка реализовать обмен значений соседних элементов. Значениями обмениваются элементы с индексами 0 и 1, 2 и
# 3 и т. д. При нечётном количестве элементов последний сохранить на своём месте. Для заполнения списка элементов нужно
# использовать функцию input().

li = []

# Запросим длину списка
length = int(input('Укажите длину списка (целое число): '))

# Получим элементы списка
i = 0
for i in range(0, length):
    el = input('Введите элемент списка: ')
    li.append(el)
    i += 1

# Поменяем местами элементы
if len(li) % 2 == 0:
    j = 0
    while j < len(li):
        el = li[j]
        li[j] = li[j + 1]
        li[j + 1] = el
        j += 2
else:
    j = 0
    while j < len(li) - 1:
        el = li[j]
        li[j] = li[j + 1]
        li[j + 1] = el
        j += 2

print(li)
