# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки. Строки
# нужно пронумеровать. Если слово длинное, выводить только первые 10 букв в слове.

phrase = str(input('Введите фразу: '))

# Превратим фразу в список слов
words = phrase.split()

for i, el in enumerate(words, 1):
    if len(el) > 10:
        el = el[0:10]
    print(f'{i}. {el}')
