# 6. * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж хранит
# информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами, то есть
# характеристиками товара: название, цена, количество, единица измерения. Структуру нужно сформировать программно,
# запросив все данные у пользователя.
# Пример готовой структуры:
#
# [
# (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
# (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
# (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
#
# Нужно собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара, например,
# название. Тогда значение — список значений-характеристик, например, список названий товаров.
# Пример:
#
# {
# “название”: [“компьютер”, “принтер”, “сканер”],
# “цена”: [20000, 6000, 2000],
# “количество”: [5, 2, 7],
# “ед”: [“шт.”]
# }

goods = []

greeting = '\nЛюбая клавиша – ввести товар,\nб - выйти из программы.\nв - собрать аналитику.\nНажмите соответствующую кнопку: '
button = input(greeting)

id = 0
while button != 'б':
    if button == 'в':
        names = [x[1]['Название'] for x in goods]
        print('\"Названия\": ', names)

        prices = [x[1]['Цена'] for x in goods]
        print('\"Цены\": ', prices)

        names = [x[1]['Количество'] for x in goods]
        print('\"Названия\": ', names)

        unit_names = [x[1]['Единица измерения'] for x in goods]
        print('\"Единицы измерения\": ', unit_names)
        break
    else:
        # Сгенерируем порядковый номер товара
        id += 1

        # Запросим характеристики позиции
        name = input('Введите название товара: ')
        price = float(input('Введите цену: '))
        qty = float(input('Введите количество: '))
        units = input('Введите единицы измерения: ')

        # Вставим результирующий словарь
        li = {
            'Название': name,
            'Цена': price,
            'Количество': qty,
            'Единица измерения': units,
        }
        goods.append(tuple([id, li]))

        # Выведем готовую структуру, каждая запись с новой строки
        print(*goods, sep='\n')
        button = input(greeting)
