# Пользователь вводит время в секундах. Переведите время в часы, минуты, секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.

total_seconds = int(input('Введите время в секундах: '))
hh = total_seconds // (60 * 60)
mm = int((total_seconds - hh * (60 * 60)) / 60)
ss = int(total_seconds - hh * (60 * 60) - mm * 60)

print('{:02d}:{:02d}:{:02d}'.format(hh, mm, ss))