# 4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл
# while и арифметические операции.

num = input('Введите целое положительное число: ')

# Превратим число в список цифр
digits = [int(a) for a in str(num)]

# Сортируем список от большего к меньшему
digits.sort(reverse=True)

# Определим, есть ли у числа дробная часть
modulo = float(num) - int(num)

while modulo != 0:
    num = float(input('Введите целое положительное число: '))

print(digits[0])