# 2. Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего
# элемента. Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для его формирования используйте
# генератор. Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]. Результат: [12, 44, 4, 10, 78,
# 123].

lst = [15, 2, 3, 1, 7, 5, 4, 10]
bigger_elements = [el for el in lst if el > lst[lst.index(el) - 1] and lst.index(el) > 0]
# bigger_elements = [el for num, el in enumerate(lst) if lst[num - 1] < lst[num]]
print(f'Результат: {bigger_elements}')
